{
  "backend/main.mo": "Main Motoko actor for the GreenChef backend, defining user management, recipe generation, meal planning, saved recipes, and Stripe-based subscription upgrade logic with role-based access control.",
  "feature_evidence.json": "JSON report mapping implemented features (auth, recipe cards, Stripe payments, meal planner, etc.) to their corresponding frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries for four frontend page files: AdminPage, PaymentSuccessPage, PaymentFailurePage, and App.tsx.",
  "frontend/index.css": "Global Tailwind CSS entry file that defines CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "HTML shell for the GreenChef React SPA, setting the page title, favicon, Inter font import, and mounting the root div with the main.tsx module entry point.",
  "frontend/src/App.tsx": "Main React app entry that configures TanStack Router with all application routes (landing, dashboard, profile, saved-recipes, meal-planner, pricing, admin, payment pages) inside a shared root layout with Navbar and footer.",
  "frontend/src/components/AdBanner.tsx": "Dismissible ad banner component that renders a sponsored message only for free-tier users, with a link to the pricing page to encourage upgrades.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar component that shows plan-aware nav links (Dashboard, Saved Recipes, Meal Planner, Admin) and an Internet Identity login/logout button, with mobile menu support.",
  "frontend/src/components/PaymentSetup.tsx": "A React component that renders a form for configuring Stripe payment integration (secret key and allowed countries), showing a success state card once Stripe is already configured.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email, creates a user record, and saves their profile with a default free plan on first login.",
  "frontend/src/components/RecipeCard.tsx": "Displays a parsed recipe (supporting both JSON and plain-text formats) with ingredients, instructions, nutrition info, and actions like save/share/download, gating some features behind Pro/Premium plan checks.",
  "frontend/src/components/UpgradePromptModal.tsx": "A modal dialog that prompts the user to upgrade to a Pro or Premium plan, listing plan benefits and linking to the pricing page.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context backed by the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, recipe generation, saved recipes, and admin operations using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a custom green-themed OKLCH color palette, dark mode variables, and utility classes for cards, buttons, and shadows.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays platform stats and a user management table, allowing admins to change user subscription plans with access control checks.",
  "frontend/src/pages/DashboardPage.tsx": "Main user dashboard for entering ingredients and generating AI recipes, with daily usage tracking, plan-based limits, and a profile setup modal for new users.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page featuring a hero section, testimonials, FAQ accordion, and CTAs for login or navigation to the dashboard.",
  "frontend/src/pages/MealPlannerPage.tsx": "A premium-only page that allows users to generate a 7-day AI meal plan, display it in a structured day-by-day layout, and view an auto-generated grocery list. Requires authentication and a Premium subscription.",
  "frontend/src/pages/PaymentFailurePage.tsx": "A static page shown when a payment is cancelled or fails, displaying troubleshooting tips and buttons to retry checkout or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "A post-payment confirmation page that checks the Stripe session status and upgrades the user's plan to Pro, then displays unlocked features and navigation links.",
  "frontend/src/pages/PricingPage.tsx": "Displays Free, Pro, and Premium subscription plans with feature lists and pricing, and initiates a Stripe checkout session when the user selects a paid plan.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's account info, current subscription plan with features, and daily recipe usage stats, with a link to upgrade if on the free plan.",
  "frontend/src/pages/SavedRecipesPage.tsx": "A Pro/Premium-only page that lists the user's saved recipes in a grid using RecipeCard components, with the ability to remove individual recipes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color palette (including green shades and OKLCH-based design tokens), extended border radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state descriptor for GreenChef, a SaaS AI recipe generator app, documenting architecture, tech stack, existing features, known issues, and image requirements."
}